app/models/concerns/current_cart.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_current_cart
    if user_signed_in?
      @current_cart = current_user.cart || create_cart_for_user(current_user)
    elsif session[:cart_id]
      @current_cart = Cart.find_by(id: session[:cart_id]) || create_guest_cart

INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2024-10-10 12:54:57.630147"], ["updated_at", "2024-10-10 12:54:57.630147"]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?, ?)
UPDATE "users" SET "updated_at" = ?, "cart_id" = ? WHERE "users"."id" = ?  [["updated_at", "2024-10-10 11:51:02.696844"], ["cart_id", 1], ["id", 1]]
---
  def create_cart_for_user(user)
    cart = Cart.create(user: user)
    user.update(cart: cart)

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2024-10-10 12:52:47.376839"], ["updated_at", "2024-10-10 12:52:47.376839"]]
---
  def create_guest_cart
    cart = Cart.create