app/views/shared/_cart_icon.html.erb

    <span class="position-absolute top-0 start-100 translate-middle badge rounded-pill bg-danger">
      <%= @current_cart.cart_items.sum(:quantity) %>
---
SELECT SUM("cart_items"."quantity") FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 2]]