app/views/carts/show.html.erb


          <% if @cart&.cart_items&.empty? %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 2]]