app/controllers/carts_controller.rb

  def update_quantity
    item = current_cart.cart_items.find(params[:item_id])
    new_quantity = params[:cart_item][:quantity].to_i
    if new_quantity > 0
      item.update(quantity: new_quantity)
      flash[:notice] = 'Quantity updated successfully.'
    else
      item.destroy
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 2]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 3]]