app/controllers/products_controller.rb

  def index
    @products = Product.all.order(created_at: :desc)
---
SELECT "products".* FROM "products" ORDER BY created_at desc

  def create
    @product = current_user.products.build(product_params)
    if @product.save
---
INSERT INTO "products" ("brand", "model", "description", "condition", "finish", "title", "price", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "brand" = ?, "title" = ?, "updated_at" = ?, "image" = ? WHERE "products"."id" = ?  [["brand", "Opel"], ["title", "qef"], ["updated_at", "2021-03-19 11:35:56.955675"], ["image", "\"opel.jpeg\""], ["id", 2]]

  def set_categories
    @categories = Category.all
---
SELECT "categories".* FROM "categories"